```
krishna@turbotindias-MacBook-Pro gcp_check_labeling % terraform apply --var-file=demo.tfvars
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.default_tag_template["gcp-bigquery-table"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Actor who created the resource
            {%- set owner = $.resource.creator.items[0].actor.identity.turbot.title -%}
            created_by: "{{ owner | lower | replace(" ", "_") }}"
            
            # Creation Timestamp
            {%- set create_time = $.resource.creator.items[0].turbot.createTimestamp -%}
            created_time: "{{ create_time | lower | replace(".", "_") | replace(":", "-") }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/gcp-bigquery#/policy/types/tableLabelsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["gcp-computeengine-disk"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Actor who created the resource
            {%- set owner = $.resource.creator.items[0].actor.identity.turbot.title -%}
            created_by: "{{ owner | lower | replace(" ", "_") }}"
            
            # Creation Timestamp
            {%- set create_time = $.resource.creator.items[0].turbot.createTimestamp -%}
            created_time: "{{ create_time | lower | replace(".", "_") | replace(":", "-") }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/diskLabelsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["gcp-computeengine-instance"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Actor who created the resource
            {%- set owner = $.resource.creator.items[0].actor.identity.turbot.title -%}
            created_by: "{{ owner | lower | replace(" ", "_") }}"
            
            # Creation Timestamp
            {%- set create_time = $.resource.creator.items[0].turbot.createTimestamp -%}
            created_time: "{{ create_time | lower | replace(".", "_") | replace(":", "-") }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceLabelsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["gcp-computeengine-snapshot"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Actor who created the resource
            {%- set owner = $.resource.creator.items[0].actor.identity.turbot.title -%}
            created_by: "{{ owner | lower | replace(" ", "_") }}"
            
            # Creation Timestamp
            {%- set create_time = $.resource.creator.items[0].turbot.createTimestamp -%}
            created_time: "{{ create_time | lower | replace(".", "_") | replace(":", "-") }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/snapshotLabelsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["gcp-sql-instance"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Actor who created the resource
            {%- set owner = $.resource.creator.items[0].actor.identity.turbot.title -%}
            created_by: "{{ owner | lower | replace(" ", "_") }}"
            
            # Creation Timestamp
            {%- set create_time = $.resource.creator.items[0].turbot.createTimestamp -%}
            created_time: "{{ create_time | lower | replace(".", "_") | replace(":", "-") }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/instanceLabelsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["gcp-storage-bucket"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Actor who created the resource
            {%- set owner = $.resource.creator.items[0].actor.identity.turbot.title -%}
            created_by: "{{ owner | lower | replace(" ", "_") }}"
            
            # Creation Timestamp
            {%- set create_time = $.resource.creator.items[0].turbot.createTimestamp -%}
            created_time: "{{ create_time | lower | replace(".", "_") | replace(":", "-") }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/gcp-storage#/policy/types/bucketLabelsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["gcp-bigquery-table"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-bigquery#/policy/types/tableLabels"
      + value                        = "Check: Labels are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-disk"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/diskLabels"
      + value                        = "Check: Labels are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceLabels"
      + value                        = "Check: Labels are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/snapshotLabels"
      + value                        = "Check: Labels are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["gcp-sql-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/instanceLabels"
      + value                        = "Check: Labels are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["gcp-storage-bucket"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-storage#/policy/types/bucketLabels"
      + value                        = "Check: Labels are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.gcp_labeling will be created
  + resource "turbot_smart_folder" "gcp_labeling" {
      + description = "Defines sets of policies for the GCP Labeling baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "GCP Labeling Policies"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.gcp_labeling: Creating...
turbot_smart_folder.gcp_labeling: Creation complete after 1s [id=216671225242912]
turbot_policy_setting.default_tag_template["gcp-bigquery-table"]: Creating...
turbot_policy_setting.set_resource_tag_policies["gcp-storage-bucket"]: Creating...
turbot_policy_setting.default_tag_template["gcp-storage-bucket"]: Creating...
turbot_policy_setting.set_resource_tag_policies["gcp-bigquery-table"]: Creating...
turbot_policy_setting.default_tag_template["gcp-sql-instance"]: Creating...
turbot_policy_setting.set_resource_tag_policies["gcp-sql-instance"]: Creating...
turbot_policy_setting.default_tag_template["gcp-computeengine-disk"]: Creating...
turbot_policy_setting.default_tag_template["gcp-computeengine-snapshot"]: Creating...
turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-snapshot"]: Creating...
turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-instance"]: Creating...
turbot_policy_setting.default_tag_template["gcp-bigquery-table"]: Creation complete after 2s [id=216671227722025]
turbot_policy_setting.default_tag_template["gcp-computeengine-instance"]: Creating...
turbot_policy_setting.default_tag_template["gcp-storage-bucket"]: Creation complete after 2s [id=216671227660582]
turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-disk"]: Creating...
turbot_policy_setting.default_tag_template["gcp-computeengine-disk"]: Creation complete after 2s [id=216671228211504]
turbot_policy_setting.set_resource_tag_policies["gcp-storage-bucket"]: Creation complete after 2s [id=216671228538166]
turbot_policy_setting.set_resource_tag_policies["gcp-bigquery-table"]: Creation complete after 2s [id=216671228614976]
turbot_policy_setting.default_tag_template["gcp-sql-instance"]: Creation complete after 2s [id=216671228561723]
turbot_policy_setting.set_resource_tag_policies["gcp-sql-instance"]: Creation complete after 2s [id=216671228665156]
turbot_policy_setting.default_tag_template["gcp-computeengine-snapshot"]: Creation complete after 3s [id=216671228680519]
turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-snapshot"]: Creation complete after 3s [id=216671229288782]
turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-instance"]: Creation complete after 3s [id=216671229356370]
turbot_policy_setting.set_resource_tag_policies["gcp-computeengine-disk"]: Creation complete after 1s [id=216671229948252]
turbot_policy_setting.default_tag_template["gcp-computeengine-instance"]: Creation complete after 1s [id=216671229887831]

Apply complete! Resources: 13 added, 0 changed, 0 destroyed.

Outputs:

resource_tags = {
  "gcp-bigquery-table" = "Check: Labels are correct"
  "gcp-computeengine-disk" = "Check: Labels are correct"
  "gcp-computeengine-instance" = "Check: Labels are correct"
  "gcp-computeengine-snapshot" = "Check: Labels are correct"
  "gcp-sql-instance" = "Check: Labels are correct"
  "gcp-storage-bucket" = "Check: Labels are correct"
}
smart_folder_description = Defines sets of policies for the GCP Labeling baseline
smart_folder_name = GCP Labeling Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher